Repository: ekg2/ekg2
Catalog: po/*.po
Languages: pl

source: %s: option `%s' is ambiguous
pl: %s: opcja `%s' jest dwuznaczna

source: %s: option `--%s' doesn't allow an argument
pl: %s: opcja `--%s' nie dopuszcza argumentu

source: %s: option `%c%s' doesn't allow an argument
pl: %s: opcja `%c%s' nie dopuszcza argumentu

source: %s: option `%s' requires an argument
pl: %s: opcja `%s' wymaga argumentu

source: %s: unrecognized option `--%s'
pl: %s: nieznana opcja `--%s'

source: %s: unrecognized option `%c%s'
pl: %s: nieznana opcja `%c%s'

source: %s: illegal option -- %c
pl: %s: nieprawid³owa opcja -- %c

source: %s: invalid option -- %c
pl: %s: nieprawid³owa opcja -- %c

source: %s: option requires an argument -- %c
pl: %s: opcja wymaga argumentu -- %c

source: %s: option `-W %s' is ambiguous
pl: %s: opcja `-W %s' jest dwuznaczna

source: %s: option `-W %s' doesn't allow an argument
pl: %s: opcja `-W %s' nie dopuszcza argumentu

source: Can't find user's home directory. Ask administration to fix it.
pl: Nie mogê znale¼æ katalogu domowego. Popro¶ administratora, ¿eby to naprawi³.

source: To get more information, start program with --help.
pl: Aby uzyskaæ wiêcej informacji, uruchom program z opcj± --help.

source: Error while saving.
pl: Wyst±pi³ b³±d podczas zapisu.

source: (none)
pl: (brak)

source: %! Too few parameters. Try %Thelp %1%n
pl: %! Za ma³o parametrów. Spróbuj %Thelp %1%n

source: %! Invalid parameters. Try %Thelp %1%n
pl: %! Nieprawid³owe parametry. Spróbuj %Thelp %1%n

source: %! Required variable %T%2%n by %T%1%n is unset
pl: %! Wymagana zmienna %T%2%n nie zosta³a ustawiona

source: %! Invalid user id
pl: %! Nieprawid³owy identyfikator u¿ytkownika

source: %! Invalid session
pl: %! Nieprawid³owa sesja

source: %! Invalid username
pl: %! Nieprawid³owa nazwa u¿ytkownika

source: %! User %T%1%n not found
pl: %! Nie znaleziono u¿ytkownika %T%1%n

source: %! This function isn't ready yet
pl: %! Tej funkcji jeszcze nie ma

source: %! Unknown command: %T%1%n
pl: %! Nieznane polecenie: %T%1%n

source: %> %Tekg2-%1%n (%ge%Gk%gg %Gr%ge%Gl%go%Ga%gd%Ge%gd%n) %> Software licensed on GPL v2 terms
pl: %> %Tekg2-%1%n (%ge%Gk%gg %Gr%ge%Ga%gk%Gt%gy%Gw%ga%Gc%gj%Ga%n) %> Program jest rozprowadzany na zasadach licencji GPL v2

source: welcome in e k g 2.
pl: witamy w e k g 2.

source: %) %Tekg2-%1%n (compiled %2)
pl: %) %Tekg2-%1%n (skompilowano %2)

source: %Y(encrypted)%n
pl: %Y(szyfrowane)%n

source: %> (%2) Added %T%1%n to roster
pl: %> (%2) Dopisano %T%1%n do listy kontaktów

source: %) (%2) Removed %T%1%n from roster
pl: %) (%2) Usuniêto %T%1%n z listy kontaktów

source: %) (%1) Roster cleared
pl: %) (%1) Wyczyszczono listê kontaktów

source: %! (%2) %T%1%n already in roster
pl: %! (%2) %T%1%n ju¿ istnieje w li¶cie kontaktów

source: %! (%3) %T%1%n already in roster as %2
pl: %! (%3) %T%1%n ju¿ istnieje w li¶cie kontaktów jako %2

source: %> (%1) Status changed to %Gaway%n
pl: %> (%1) Zmieniono stan na %Gzajêty%n

source: %> (%3) Status changed to %Gaway%n: %T%1%n%2
pl: %> (%3) Zmieniono stan na %Gzajêty%n: %T%1%n%2

source: %> (%1) Status changed to %Yavailable%n
pl: %> (%1) Zmieniono stan na %Ydostêpny%n

source: %> (%3) Status changed to %Yavailable%n: %T%1%n%2%n
pl: %> (%3) Zmieniono stan na %Ydostêpny%n: %T%1%n%2%n

source: %> (%1) Status changed to %cinvisible%n
pl: %> (%1) Zmieniono stan na %cniewidoczny%n

source: %> (%3) Status changed to %cinvisible%n: %T%1%n%2
pl: %> (%3) Zmieniono stan na %cniewidoczny%n: %T%1%n%2

source: %> (%1) Status changed to %Bdo not disturb%n
pl: %> (%1) Zmieniono stan na %Bnie przeszkadzaæ%n

source: %> (%3) Status changed to %Bdo not disturb%n: %T%1%n%2
pl: %> (%3) Zmieniono stan na %Bnie przeszkadzaæ%n: %T%1%n%2%n

source: %> (%1) Status changed to %Wfree for chat%n
pl: %> (%1) Zmieniono stan na %Wchêtny do rozmowy%n

source: %> (%3) Status changed to %Wfree for chat%n: %T%1%n%2%n
pl: %> (%3) Zmieniono stan na %Wchêtny do rozmowy%n: %T%1%n%2%n

source: %> (%1) Status changed to %gextended away%n
pl: %> (%1) Zmieniono stan na %gextended away%n

source: %> (%3) Status changed to %gextended away%n: %T%1%n%2%n%n
pl: %> (%3) Zmieniono stan na %gextended away%n: %T%1%n%2%n%n

source: % (%1) Friends only mode is on
pl: %> (%1) Tryb ,,tylko dla znajomych'' jest w³±czony

source: %> (%1) Friends only mode is off
pl: %> (%1) Tryb ,,tylko dla znajomych'' jest wy³±czony

source: %) (%1) Turned on ,,friends only'' mode
pl: %> (%1) W³±czono tryb ,,tylko dla znajomych''

source: %> (%1) Turned off ,,friends only'' mode
pl: %> (%1) Wy³±czono tryb ,,tylko dla znajomych''

source: %! Invalid value'
pl: %! Nieprawid³owy identyfikator u¿ytkownika

source: %! Description longer than maximum %T%1%n characters Descr: %B%2%b%3%n
pl: %! %|D³ugo¶æ opisu przekracza limit o %T%1%n znaków Opis:%B%2%b%3%n

source: %> (%1) Auto %Gaway%n
pl: %> (%1) Automagicznie zmieniono stan na %Gzajêty%n

source: %> (%3) Auto %Gaway%n: %T%1%n%2%n
pl: %> (%3) Automagicznie zmieniono stan na %Gzajêty%n: %T%1%n%2%n

source: %> (%1) Auto back - %Yavailable%n
pl: %> (%1) Automagicznie zmieniono stan na %Ydostêpny%n

source: %> (%3) Auto back - %Yavailable%n: %T%1%n%2%n
pl: %> (%3) Automagicznie zmieniono stan na %Ydostêpny%n: %T%1%n%2%n

source: %) %T%1%n is an alias and don't have description
pl: %) %T%1%n jest aliasem i nie posiada opisu

source: %> %|%Thelp <command>%n will show more details about command. Prepending %T^%n to command name will hide it's result. Instead of <uid/alias> one can use %T$%n, which means current query user.
pl: %> %|Wiêcej szczegó³ów na temat komend zwróci %Thelp <komenda>%n. Poprzedzenie komendy znakiem %T^%n spowoduje ukrycie jej wyniku. Zamiast parametru <numer/alias> mo¿na u¿yæ znaku %T$%n oznaczaj±cego aktualnego rozmówcê.

source: %> %|Before using consult the brochure. File %Tdocs/ULOTKA.en%n is a short guide on included documentation. If you don't have it, you can visit %Thttp://www.ekg2.org/%n
pl: %> %|Przed u¿yciem przeczytaj ulotkê. Plik %Tdocs/ULOTKA%n zawiera krótki przewodnik po za³±czonej dokumentacji. Je¶li go nie masz, mo¿esz ¶ci±gn±æ pakiet ze strony %Thttp://www.ekg2.org/%n

source: %! Can't find variables descriptions (incomplete installation)
pl: %! Nie znaleziono opisu zmiennych (nieprawid³owa instalacja)

source: %! Can't find variables descriptions for %T%1%n plugin (incomplete installation)
pl: %! Nie znaleziono opisu zmiennych dla pluginu %T%1%n (nieprawid³owa instalacja)

source: %! Cant find description of %T%1%n variable
pl: %! Nie znaleziono opisu zmiennej %T%1%n

source: %> %T%1%n (%2, default value: %3) %>
pl: %> %T%1%n (%2, domy¶lna warto¶æ: %3) %>

source: %! Can't find commands descriptions (incomplete installation)
pl: %! Nie znaleziono opisu komend (nieprawid³owa instalacja)

source: %! Can't find commands descriptions for %T%1%n plugin (incomplete installation)
pl: %! Nie znaleziono opisu komend dla pluginu %T%1%n (nieprawid³owa instalacja)

source: %! Can't find command description: %T%1%n
pl: %! Nie znaleziono opisu komendy %T%1%n

source: %> Ignoring %T%1%n
pl: %> Dodano %T%1%n do listy ignorowanych

source: %> Modified ignore level of %T%1%n
pl: %> Zmodyfikowano poziom ignorowania %T%1%n

source: %) Unignored %1
pl: %) Usuniêto %1 z listy ignorowanych

source: %) Ignore list cleared up
pl: %) Usuniêto wszystkich z listy ignorowanych

source: %! %1 already beeing ignored
pl: %! %1 jest ju¿ na li¶cie ignorowanych

source: %! Ignore list ist empty
pl: %! Lista ignorowanych u¿ytkowników jest pusta

source: %! %1 is not beeing ignored
pl: %! %1 nie jest na li¶cie ignorowanych

source: %> Blocking %T%1%n
pl: %> Dodano %T%1%n do listy blokowanych

source: %) Unblocking %1
pl: %) Usuniêto %1 z listy blokowanych

source: %) Block list cleared up
pl: %) Usuniêto wszystkich z listy blokowanych

source: %! %1 already beeing blocked
pl: %! %1 jest ju¿ na li¶cie blokowanych

source: %! Block list is empty
pl: %! Lista blokowanych u¿ytkowników jest pusta

source: %! %1 is not beeing blocked
pl: %! %1 nie jest na li¶cie blokowanych

source: %! Roster is empty
pl: %! Lista kontaktów jest pusta

source: %> %1 %Y(available)%n %b%3:%4%n
pl: %> %1 %Y(dostêpn%@2)%n %b%3:%4%n

source: %> %1 %Y(available: %n%5%Y)%n %b%3:%4%n
pl: %> %1 %Y(dostêpn%@2: %n%5%Y)%n %b%3:%4%n

source: %> %1 %G(away)%n %b%3:%4%n
pl: %> %1 %G(zajêt%@2)%n %b%3:%4%n

source: %> %1 %G(away: %n%5%G)%n %b%3:%4%n
pl: %> %1 %G(zajêt%@2: %n%5%G)%n %b%3:%4%n

source: %> %1 %B(do not disturb)%n %b%3:%4%n
pl: %> %1 %B(nie przeszkadzaæ)%n %b%3:%4%n

source: %> %1 %G(do not disturb:%n %5%G)%n %b%3:%4%n
pl: %> %1 %G(nie przeszkadzaæ%n: %5%G)%n %b%3:%4%n

source: %> %1 %W(free for chat)%n %b%3:%4%n
pl: %> %1 %W(chêtny do rozmowy)%n %b%3:%4%n

source: %> %1 %W(free for chat%n: %5%W)%n %b%3:%4%n
pl: %> %1 %W(chêtny do rozmowy%n: %5%W)%n %b%3:%4%n

source: %> %1 %m(error) %b%3:%4%n
pl: %> %1 %m(b³±d) %b%3:%4%n

source: %> %1 %m(error%n: %5%m)%n %b%3:%4%n
pl: %> %1 %m(b³±d%n: %5%m)%n %b%3:%4%n

source: %> %1 %g(extended away)%n %b%3:%4%n
pl: %> %1 %g(bardzo zajêt%@2)%n %b%3:%4%n

source: %> %1 %g(extended away: %n%5%g)%n %b%3:%4%n
pl: %> %1 %g(bardzo zajêt%@2: %n%5%g)%n %b%3:%4%n

source: %> %1 %r(offline)%n
pl: %> %1 %r(niedostêpn%@2)%n

source: %> %1 %r(offline: %n%5%r)%n
pl: %> %1 %r(niedostêpn%@2: %n%5%r)%n

source: %> %1 %c(invisible)%n %b%3:%4%n
pl: %> %1 %c(niewidoczn%@2)%n %b%3:%4%n

source: %> %1 %c(invisible: %n%5%c)%n %b%3:%4%n
pl: %> %1 %c(niewidoczn%@2: %n%5%c)%n %b%3:%4%n

source: %> %1 %m(blocking)%n
pl: %> %1 %m(blokuj±c%@2)%n

source: %> %1 will not see your status
pl: %> %1 nie bêdzie widzieæ naszego stanu

source: %> %1 will see your status
pl: %> %1 bêdzie widzieæ nasz stan

source: %> Modified item in roster
pl: %> Zmieniono wpis w li¶cie kontaktów

source: %> Bye
pl: %> Papa

source: %> Bye: %T%1%n%2
pl: %> Papa: %T%1%n%2

source: Save new configuration ? (t-yes/n-no)
pl: Zapisaæ now± konfiguracjê? (tak/nie)

source: You've set keep_reason to save status. Do you want to save current description to file (it will be restored upon next EKG exec)? (t-yes/n-no)
pl: Ustawi³e¶ keep_reason, tak aby zachowywa³ opisy. Czy chcesz zachowaæ aktualny opis do pliku (przy nastêpnym uruchomieniu EKG opis ten zostanie przywrócony)? (tak/nie)

source: %> Configuration saved
pl: %> Zapisano ustawienia

source: %! There was some error during save
pl: %! Podczas zapisu ustawieñ wyst±pi³ b³±d

source: message from %1: %3.
pl: wiadomo¶æ od %1: %3.

source: %m.-- %TSystem message%m --- -- -%n %m|%n %|%3%n %|%m`----- ---- --- -- -%n
pl: %m.-- %TWiadomo¶æ systemowa%m --- -- -%n %m|%n %|%3%n %|%m`----- ---- --- -- -%n

source: system message: %3.
pl: wiadomo¶æ systemowa: %3.

source: %> Message to %1 will be delivered later
pl: %> Wiadomo¶æ do %1 zostanie dostarczona pó¼niej

source: %> Message to %1 delivered
pl: %> Wiadomo¶æ do %1 zosta³a dostarczona

source: %> Not clear what happened to message to %1
pl: %> Nie wiadomo, co siê sta³o z wiadomo¶ci± do %1

source: %! %|Message to %1 probably was not delivered. The person is unavailable, but server claims message is delivered. Message could been filtered out (e.g. because of web address in it)
pl: %! %|Wiadomo¶æ do %1 najprawdopodobniej nie zosta³a dostarczona, poniewa¿ dana osoba jest niedostêpna, a serwer twierdzi, ¿e dorêczy³ wiadomo¶æ. Sytuacja taka ma miejsce, gdy wiadomo¶æ zosta³a odrzucona przez filtry serwera (np. zawiera adres strony WWW)

source: %! Message was too long and got shortened
pl: %! Wiadomo¶æ jest zbyt d³uga i zosta³a skrócona

source: %> (%3) %1 is %Yavailable%n
pl: %> (%3) %1 jest %Ydostêpn%@2%n

source: %> (%3) %1 is %Yavailable%n: %T%4%n
pl: %> (%3) %1 jest %Ydostêpn%@2%n: %T%4%n

source: %> (%3) %1 is %Gaway%n
pl: %> (%3) %1 jest %Gzajêt%@2%n

source: %> (%3) %1 is %Gaway%n: %T%4%n
pl: %> (%3) %1 jest %Gzajêt%@2%n: %T%4%n

source: %> (%3) %1 is %roffline%n
pl: %> (%3) %1 jest %rniedostêpn%@2%n

source: %> (%3) %1 is %roffline%n: %T%4%n
pl: %> (%3) %1 jest %rniedostêpn%@2%n: %T%4%n

source: %> (%3) %1 is %cinvisible%n
pl: %> (%3) %1 jest %cniewidoczn%@2%n

source: %> (%3) %1 is %cinvisible%n: %T%4%n
pl: %> (%3) %1 jest %cniewidoczn%@2%n: %T%4%n

source: %> (%3) %1 is %gextended away%n
pl: %> (%3) %1 jest %gbardzo zajêt%@2%n

source: %> (%3) %1 is %gextended away%n: %T%4%n
pl: %> (%3) %1 jest %gbardzo zajêt%@2%n: %T%4%n

source: %> (%3) %1 %Bdo not disturb%n
pl: %> (%3) %1 %Bnie przeszkadzaæ%n

source: %> (%3) %1 %Bdo not disturb%n: %T%4%n
pl: %> (%3) %1 %Bnie przeszkadzaæ%n: %T%4%n

source: %> (%3) %1 %merror fetching status%n
pl: %> (%3) %1 %mb³±d pobierania statusu%n

source: %> (%3) %1 %merror fetching status%n: %T%4%n
pl: %> (%3) %1 %mb³±d pobierania statusu%n: %T%4%n

source: %> (%3) %1 is %Wfree for chat%n
pl: %> (%3) %1 jest %Wchêtn%@2 do rozmowy%n

source: %> (%3) %1 is %Wfree for chat%n: %T%4%n
pl: %> (%3) %1 jest %Wchêtn%@2 do rozmowy%n: %T%4%n

source: %> (%1) Connecting to server %n
pl: %> (%1) £±czenie z serwerem %n

source: %! (%2) Connection failure: %1%n
pl: %! (%2) Po³±czenie nie powiod³o siê: %1%n

source: Server not found
pl: Nie znaleziono serwera

source: Can't connect to server
pl: Nie mo¿na po³±czyæ siê z serwerem

source: Invalid server response
pl: Nieprawid³owa odpowied¼ serwera

source: Server disconnected
pl: Serwer zerwa³ po³±czenie

source: Invalid password
pl: Nieprawid³owe has³o

source: HTTP server error
pl: B³±d serwera HTTP

source: Error negotiating TLS
pl: B³±d negocjacji TLS

source: No memory
pl: Brak pamiêci

source: %! (%1) Connection interrupted %n
pl: %! (%1) Przerwano ³±czenie %n

source: %! (%1) Connection timed out%n
pl: %! (%1) Przekroczono limit czasu operacji ³±czenia z serwerem%n

source: %> (%1) Connected%n
pl: %> (%1) Po³±czono%n

source: %> (%2) Connected: %T%1%n
pl: %> (%2) Po³±czono: %T%1%n

source: %> (%1) Disconnected%n
pl: %> (%1) Roz³±czono%n

source: %> (%2) Disconnected: %T%1%n
pl: %> (%2) Roz³±czono: %T%1%n

source: %! (%1) Already connected. Use %Treconnect%n to reconnect%n
pl: %! (%1) Klient jest ju¿ po³±czony. Wpisz %Treconnect%n aby po³±czyæ ponownie%n

source: %! (%1) Connecting in progress. Use %Tdisconnect%n to abort%n
pl: %! (%1) £±czenie trwa. Wpisz %Tdisconnect%n aby przerwaæ%n

source: %! (%1) Connection broken%n
pl: %! (%1) Po³±czenie zosta³o przerwane%n

source: %! (%1) Server disconnected%n
pl: %! (%1) Serwer zerwa³ po³±czenie%n

source: %! (%1) Not connected.%n
pl: %! (%1) Brak po³±czenia z serwerem.%n

source: %! (%1) Not connected. Message will be delivered when connected.%n
pl: %! (%1) Brak po³±czenia z serwerem. Wiadomo¶æ bêdzie wys³ana po po³±czeniu.%n

source: %! (%1) Wrong session id.%n
pl: %! (%1) Z³y id sesji.%n

source: %! (%1) Invalid "server".%n
pl: %! (%1) B³êdna warto¶æ zmiennej sesyjnej "server".%n

source: %! (%1) Invalid local address. I'm clearing %Tlocal_ip%n session variable
pl: %! (%1) Nieprawid³owy adres lokalny. Czyszczê zmienn± sesyjn± %Tlocal_ip%n

source: %! (%1) EKG2 won't try to connect anymore - use /connect.%n
pl: %! (%1) EKG2 nie bêdzie siê ju¿ wiêcej ³±czy³ - u¿yj /connect.%n

source: %! Unknown variable: %T%1%n
pl: %! Nieznana zmienna: %T%1%n

source: %! Invalid session variable value
pl: %! Nieprawid³owa warto¶æ zmiennej

source: %! Incomplete configuration. Use: %! %Tsession -a <gg:gg-number/jid:jabber-id>%n %! %Tsession password <password>%n %! %Tsave%n %! And then: %! %Tconnect%n %! If you don't have uid, use: %! %Tregister <e-mail> <password>%n %> %|Query windows will be created automatically. To switch windows press %TAlt-number%n or %TEsc%n and then number. To start conversation use %Tquery%n. To add someone to roster use %Tadd%n. All key shortcuts are described in %TREADME%n. There is also %Thelp%n command. Remember about prefixes before UID, for example %Tgg:<no>%n.
pl: %! Niekompletna konfiguracja. Wpisz: %! %Tsession -a <gg:numerek-gg/jid:jabber-id>%n %! %Tsession password <has³o>%n %! %Tsave%n %! Nastêpnie wydaj polecenie: %! %Tconnect%n %! Je¶li nie masz swojego numerka, wpisz: %! %Tregister <e-mail> <has³o>%n %> %|Po po³±czeniu, nowe okna rozmowy bêd± tworzone automatycznie, gdy kto¶ przy¶le wiadomo¶æ. Aby przej¶æ do okna o podanym numerze nale¿y wcisn±æ %TAlt-numer%n lub %TEsc%n, a nastêpnie cyfrê. Aby rozpocz±æ rozmowê, nale¿y u¿yæ polecenia %Tquery%n. Aby dodaæ kogo¶ do listy kontaktów, nale¿y u¿yæ polecenia %Tadd%n. Wszystkie kombinacje klawiszy s± opisane w pliku %TREADME%n, a listê komend wy¶wietla polecenie %Thelp%n. Pamiêtaj o prefixie przed ka¿dym UID'em, prawid³owy przyk³adowy UID ma postaæ: %Tgg:<nr>%n.

source: %! Error reading configuration file: %1
pl: %! Nie mo¿na odczytaæ pliku konfiguracyjnego: %1

source: %> Configuratin read correctly.%n
pl: %> Zapisano ustawienia

source: %! Invalid line '%T%1%n', skipping
pl: %! Nieprawid³owa linia '%T%1%n', pomijam

source: %> Automatically saved settings
pl: %> Automatycznie zapisano ustawienia

source: %> Registration successful. Your number: %T%1%n
pl: %> Rejestracja poprawna. Wygrany numerek: %T%1%n

source: %! Error during registration: %1
pl: %! B³±d podczas rejestracji: %1

source: %! Registration in progress
pl: %! Rejestracja w toku

source: %! Registration timed out
pl: %! Przekroczono limit czasu operacji rejestrowania

source: %! Already registered. Do not abuse
pl: %! Ju¿ zarejestrowano jeden numer. Nie nadu¿ywaj

source: %> Account removed
pl: %> Konto %T%1%n zosta³o usuniête

source: %! Account removal timed out
pl: %! Przekroczono limit czasu operacji usuwania konta

source: %! Unknown uin: %T%1%n
pl: %! Niepoprawny numer: %T%1%n

source: %! Error while deleting account: %1
pl: %! B³±d podczas usuwania konta: %1

source: %> Password sent
pl: %> Has³o zosta³o wys³ane

source: %! Error while sending password: %1
pl: %! B³±d podczas wysy³ania has³a: %1

source: %! Password sending timed out
pl: %! Przekroczono limit czasu operacji wys³ania has³a

source: %> Password changed
pl: %> Has³o zosta³o zmienione

source: %! Error while changing password: %1
pl: %! B³±d podczas zmiany has³a: %1

source: %! Password changing timed out
pl: %! Przekroczono limit czasu operacji zmiany has³a

source: %> Informations in public directory chenged
pl: %> Informacje w katalogu publicznym zosta³y zmienione

source: %! Error while changing informations in public directory
pl: %! B³±d podczas zmiany informacji w katalogu publicznym

source: %! Error while search: %1
pl: %! Wyst±pi³ b³±d podczas szukania: %1

source: %! Not found
pl: %! Nie znaleziono

source: %! Last search returned no result
pl: %! Brak wyników ostatniego wyszukiwania

source: %! No nickname in last search
pl: %! Brak pseudonimu w ostatnim wyszukiwaniu

source: %> Search stopped
pl: %> Zatrzymano wyszukiwanie

source: %Y(available)%N
pl: %Y(dostêpn%@1)%n

source: %r(offline)%n
pl: %r(niedostêpn%@1)%n

source: %) Nickname: %T%3%n %) Number: %T%1%n %7 %) Name: %T%2%n %) City: %T%4%n %) Birth year: %T%5%n
pl: %) Pseudonim: %T%3%n %) Numerek: %T%1%n %7 %) Imiê i nazwisko: %T%2%n %) Miejscowo¶æ: %T%4%n %) Rok urodzenia: %T%5%n

source: %! There are no running procesees
pl: %! Nie ma dzia³aj±cych procesów

source: %> Proces %1 (%2) exited with %3 status
pl: %> Proces %1 (%2) zakoñczy³ dzia³anie z wynikiem %3

source: %! Error running process : %1
pl: %! B³±d uruchamiania procesu: %1

source: %K| %nNickname: %T%1%n
pl: %K| %nPseudonim: %T%1%n

source: %K| %nName: %T%1 %2%n
pl: %K| %nImiê i nazwisko: %T%1 %2%n

source: %K| %nStatus: %T%1%n
pl: %K| %nStan: %T%1%n

source: %K| %nCurrent status since: %T%1%n
pl: %K| %nAktualny stan od: %T%1%n

source: %K| %nSubscription type: %T%1%n
pl: %K| %nRodzaj autoryzacji: %T%1%n

source: %K| %nBlocked
pl: %K| %nBlokowan%@1

source: %K| %nCan't see our status
pl: %K| %nNie widzi naszego stanu

source: %K| %nDoesn't have us in roster
pl: %K| %nNie ma nas w swoich kontaktach

source: %K| %nFirewalled/NATed
pl: %K| %nZnajduje siê za firewall/NAT

source: %K| %nAddress: %T%1%n
pl: %K| %nAdres: %T%1%n

source: %K| %nTelephone: %T%1%n
pl: %K| %nTelefon: %T%1%n

source: %K| %nGroups: %T%1%n
pl: %K| %nGrupy: %T%1%n

source: %K| %nNever seen
pl: %K| %nNigdy nie widziano

source: %K| %nLast seen: %T%1%n
pl: %K| %nOstatnio widziano: %T%1%n

source: %K| %nLast address: %T%1%n
pl: %K| %nOstatni adres: %T%1%n

source: %K| %nLast status: %T%1%n
pl: %K| %nOstatni stan: %T%1%n

source: %K| %nVersion: %T%1%n
pl: %K| %nWersja klienta: %T%1%n

source: %K| %nHas voice talk
pl: %K| %nObs³uguje rozmowy g³osowe

source: %Yavailable%n
pl: %Ydostêpn%@1%n

source: %Yavailable%n %K(%n%2%K)%n
pl: %Ydostêpn%@1%n %K(%n%2%K)%n

source: %Gaway%n %K(%n%2%K)%n
pl: %Gzajêt%@1%n %K(%n%2%K)%n

source: %roffline%n
pl: %rniedostêpn%@1%n

source: %roffline%n %K(%n%2%K)%n
pl: %rniedostêpn%@1%n %K(%n%2%K)%n

source: %cinvisible%n %K(%n%2%K)%n
pl: %cniewidoczn%@1%n %K(%n%2%K)%n

source: %Bdo not disturb%n
pl: %Bnie przeszkadzaæ%n

source: %Bdo not disturb%n %K(%n%2%K)%n
pl: %Bnie przeszkadzaæ%n %K(%n%2%K)%n

source: %Wfree for chat%n
pl: %Wchêtn%@1 do rozmowy%n

source: %Wfree for chat%n %K(%n%2%K)%n
pl: %Wchêtn%@1 do rozmowy%n %K(%n%2%K)%n

source: %m error%n
pl: %m b³±d%n

source: %merror%n %K(%n%2%K)%n
pl: %mb³±d%n %K(%n%2%K)%n

source: %gextended away%n %K(%n%2%K)%n
pl: %gbardzo zajêt%@1%n %K(%n%2%K)%n

source: %mblocking%n %K(%n%2%K)%n
pl: %mblokuj±c%@1%n %K(%n%2%K)%n

source: %Munknown%n
pl: %Mnieznany%n

source: %> %|Group %T%1%n: %2
pl: %> %|Grupa %T%1%n: %2

source: %! %1 already in group %T%2%n
pl: %! %1 nale¿y ju¿ do grupy %T%2%n

source: %! %1 not in group %T%2%n
pl: %! %1 nie nale¿y do grupy %T%2%n

source: %! Group %T%1%n is empty
pl: %! Grupa %T%1%n jest pusta

source: %) Profile: %T%1%n
pl: %) Profil: %T%1%n

source: %) Current status: %T%1%2%n
pl: %) Aktualny stan: %T%1%2%n

source: %) Current status: %T%1%n
pl: %) Aktualny stan: %T%1%n

source: %) Current server: %T%1%n:%T%2%n
pl: %) Aktualny serwer: %T%1%n:%T%2%n

source: %) Current server: %T%1%n:%T%2%Y (connection encrypted)%n
pl: %) Aktualny serwer: %T%1%n:%T%2%Y (po³±czenie szyfrowane)%n

source: %) Connecting ...
pl: %) Trwa ³±czenie ...

source: %Yavailable%n (%T%1%n%2)
pl: %Ydostêpny%n (%T%1%n%2)

source: %Gaway%n (%T%1%n%2)
pl: %Gzajêty%n (%T%1%n%2)

source: %cinvisible%n (%T%1%n%2)
pl: %cniewidoczn%@1%n %K(%n%2%K)%n

source: %gextended away%n (%T%1%n%2)
pl: %gbardzo zajêt%@1%n %K(%n%2%K)%n

source: %cdo not disturb%n (%T%1%n%2)
pl: %Bnie przeszkadzaæ%n %K(%n%2%K)%n

source: %Wfree for chat%n (%T%1%n%2)
pl: %Wchêtn%@1 do rozmowy%n %K(%n%2%K)%n

source: , for friends only
pl: , tylko dla znajomych

source: %) Connected since: %T%1%n
pl: %) Po³±czony od: %T%1%n

source: %) Disconnected since: %T%1%n
pl: %) Roz³±czony od: %T%1%n

source: %) Program started: %T%1%n
pl: %) Program dzia³a od: %T%1%n

source: %) Messages queued for delivery: %T%1%n
pl: %) Ilo¶æ wiadomo¶ci w kolejce do wys³ania: %T%1%n

source: %! No aliases
pl: %! Brak aliasów

source: %> Created alias %T%1%n
pl: %> Utworzono alias %T%1%n

source: %> Added to alias %T%1%n
pl: %> Dodano do aliasu %T%1%n

source: %) Removed alias %T%1%n
pl: %) Usuniêto alias %T%1%n

source: %) Removed all aliases
pl: %) Usuniêto wszystkie aliasy

source: %! Alias %T%1%n already exists
pl: %! Alias %T%1%n ju¿ istnieje

source: %! Alias %T%1%n doesn't exist
pl: %! Alias %T%1%n nie istnieje

source: %! %T%1%n is internal command
pl: %! %T%1%n jest wbudowan± komend±

source: %! Alias %T%1%n requires more parameters
pl: %! Alias %T%1%n wymaga wiêkszej ilo¶ci parametrów

source: %! To many direct connections, last from %1
pl: %! %|Program otrzyma³ zbyt wiele ¿±dañ bezpo¶rednich po³±czeñ, ostatnie od %1

source: %! %|Direct connections count over limit, so they got disabled. To enable them use %Tset dcc 1% and reconnect. Limit is controlled by %Tdcc_limit%n variable.
pl: %! %|Przekroczono limit bezpo¶rednich po³±czeñ i dla bezpieczeñstwa zosta³y one wy³±czone. Aby je w³±czyæ ponownie, nale¿y wpisaæ polecenie %Tset dcc 1%n i po³±czyæ siê ponownie. Limit mo¿na zmieniæ za pomoc± zmiennej %Tdcc_limit%n.
