Repository: ekg2/ekg2
Catalog: po/*.po
Languages: pl

source: %! Can't turn on direct connections: %1
pl: %! Nie mo¿na w³±czyæ po³±czeñ bezpo¶rednich: %1

source: %! Error transmitting with %1
pl: %! B³±d transmisji z %1

source: %! Connection to %1 refused
pl: %! Po³±czenie z %1 zosta³o odrzucone

source: %! Uknown direct connection error
pl: %! Nieznany b³±d po³±czenia bezpo¶redniego

source: %! Can't connect with %1
pl: %! Nie mo¿na nawi±zaæ po³±czenia z %1

source: %! %1 doesn't have direct connections enabled
pl: %! %1 nie ma w³±czonej obs³ugi po³±czeñ bezpo¶rednich

source: %! Direct connection to %1 timed out
pl: %! Przekroczono limit czasu operacji bezpo¶redniego po³±czenia z %1

source: %! Operation %T%1%n isn't supported yet
pl: %! Opcja %T%1%n nie jest jeszcze obs³ugiwana

source: %! Can't open %T%1%n: %2
pl: %! Nie mo¿na otworzyæ %T%1%n: %2

source: %> Pending connections:
pl: %> Po³±czenia oczekuj±ce:

source: %) #%1, %2, sending %T%3%n
pl: %) #%1, %2, wysy³anie %T%3%n

source: %) #%1, %2, receiving %T%3%n
pl: %) #%1, %2, odbiór %T%3%n

source: %) #%1, %2, chat
pl: %) #%1, %2, rozmowa

source: %> Active connections:
pl: %> Po³±czenia aktywne:

source: %) #%1, %2, sending %T%3%n, %T%4b%n z %T%5b%n (%6%%)
pl: %) #%1, %2, wysy³anie %T%3%n, %T%4b%n z %T%5b%n (%6%%)

source: %) #%1, %2, receiving %T%3%n, %T%4b%n z %T%5b%n (%6%%)
pl: %) #%1, %2, odbiór %T%3%n, %T%4b%n z %T%5b%n (%6%%)

source: %! No direct connections
pl: %! Brak bezpo¶rednich po³±czeñ

source: %! File %T%1%n from %2 is being received
pl: %! Plik %T%1%n od u¿ytkownika %2 jest ju¿ pobierany

source: %> Finished receiving file %T%2%n from %1
pl: %> Zakoñczono pobieranie pliku %T%2%n od %1

source: %> Finished sending file %T%2%n to %1
pl: %> Zakoñczono wysy³anie pliku %T%2%n do %1

source: %) Connection with %1 closed
pl: %) Zamkniêto po³±czenie z %1

source: %) %1 wants to chat %) Use %Tdcc voice #%2%n to start chat or %Tdcc close #%2%n to refuse
pl: %) %1 chce rozmawiaæ %) Wpisz %Tdcc voice #%2%n, by rozpocz±æ rozmowê, lub %Tdcc close #%2%n, by anulowaæ

source: %! Only one simultanous voice chat possible
pl: %! Mo¿na prowadziæ tylko jedn± rozmowê g³osow± na raz

source: %! Voice chat not compiled in. See %Tdocs/voip.txt%n
pl: %! Nie wkompilowano obs³ugi rozmów g³osowych. Przeczytaj %Tdocs/voip.txt%n

source: %) %1 sends %T%2%n (size %T%3b%n) %) Use %Tdcc get #%4%n to receive or %Tdcc close #%4%n to refuse
pl: %) %1 przesy³a plik %T%2%n o rozmiarze %T%3b%n %) Wpisz %Tdcc get #%4%n, by go odebraæ, lub %Tdcc close #%4%n, by anulowaæ

source: %) File exist, you can resume with %Tdcc resume #%4%n
pl: %) Plik istnieje ju¿ na dysku, wiêc mo¿na wznowiæ pobieranie poleceniem %Tdcc resume #%4%n

source: %) Started receiving %T%2%n from %1
pl: %) Rozpoczêto pobieranie pliku %T%2%n od %1

source: %! Can't open file %T%1%n
pl: %! Nie mo¿na utworzyæ pliku %T%1%n

source: %! Connection not found: %T%1%n
pl: %! Nie znaleziono po³±czenia %T%1%n

source: %! Invalid IP address
pl: %! Nieprawid³owy adres IP

source: %! %1 has to available to connect
pl: %! %1 musi byæ dostêpn%@1, by móc nawi±zaæ po³±czenie

source: %) (%2) Query with %T%1%n started
pl: %) (%2) Rozpoczêto rozmowê z %T%1%n

source: %) Press %TAlt-G%n to ignore, %TAlt-K%n to close window
pl: %) Wci¶nij %TAlt-G%n by ignorowaæ, %TAlt-K%n by zamkn±æ okno

source: %) (%2) Finished query with %T%1%n
pl: %) (%2) Zakoñczono rozmowê z %T%1%n

source: %! (%3) Query with %T%1%n already in window no %T%2%n
pl: %! (%3) Rozmowa z %T%1%n jest ju¿ prowadzona w okienku nr %T%2%n

source: %! No events
pl: %! Brak zdarzeñ

source: %> Added event %T%1%n
pl: %> Dodano zdarzenie %T%1%n

source: %) Removed event %T%1%n
pl: %) Usuniêto zdarzenie %T%1%n

source: %) Removed all events
pl: %) Usuniêto wszystkie zdarzenia

source: %! Event %T%1%n exist for %2
pl: %! Zdarzenie %T%1%n istnieje dla %2

source: %! Event %T%1%n do not exist
pl: %! Zdarzenie %T%1%n nie istnieje

source: %> Roster saved on server
pl: %> Listê kontaktów zachowano na serwerze

source: %! Error sending roster
pl: %! B³±d podczas wysy³ania listy kontaktów

source: %> Roster read from server
pl: %> Listê kontaktów wczytano z serwera

source: %! Error getting roster
pl: %! B³±d podczas pobierania listy kontaktów

source: %) Removed roster from server
pl: %) Usuniêto listê kontaktów z serwera

source: %! Error removing roster from server
pl: %! B³±d podczas usuwania listy kontaktów

source: roster:
pl: lista kontaktów:

source: %1 is available
pl: %1 jest dostêpny,

source: %1 is away
pl: %1 jest zajêty,

source: %) New window created
pl: %) Utworzono nowe okno

source: %! Choosen window do not exist
pl: %! Wybrane okno nie istnieje

source: %! Window %T%1%n does not exist
pl: %! Okno %T%1%n nie istnieje

source: %! Can't close last window
pl: %! Nie mo¿na zamkn±æ ostatniego okna

source: %) Window closed
pl: %) Zamkniêto okno

source: %! Window limit exhausted
pl: %! Wyczerpano limit ilo¶ci okien

source: %) %1: query with %T%2%n
pl: %) %1: rozmowa z %T%2%n

source: %) %1 no query
pl: %) %1: brak rozmowy

source: %) %1: floating %4x%5 in %2,%3 %T%6%n
pl: %) %1: p³ywaj±ce %4x%5 w %2,%3 %T%6%n

source: %) (%3) Query with %T%2%n started in %T%1%n
pl: %) (%3) Rozmowa z %T%2%n rozpoczêta w oknie %T%1%n

source: %! Can't close status window!
pl: %! Nie mo¿na zamkn±æ okna stanu

source: %! Can't move status window!
pl: %! Nie mo¿na przesun±æ okna statusu!

source: %! Window %T%1%n can't be moved
pl: %! Okno %T%1%n nie mo¿e zostaæ przeniesione

source: %! Sequence %T%1%n is invalid
pl: %! Sekwencja %T%1%n jest nieprawid³owa

source: %> Sequence %T%1%n added
pl: %> Dodano sekwencjê %T%1%n

source: %) Sequence %T%1%n removed
pl: %) Usuniêto sekwencjê %T%1%n

source: %! Sequence %T%1%n is already bound
pl: %! Sekwencja %T%1%n ma ju¿ przypisan± akcjê

source: %! No bound actions
pl: %! Brak przypisanych akcji

source: %! Press key(s) which should be bound
pl: %! Naci¶nij klawisz(e), które maj± byæ podbindowane

source: %> Binding added
pl: %> Bindowanie zakoñczono pomy¶lnie

source: %> Created plan %T%1%n
pl: %> Utworzono plan %T%1%n

source: %) Removed plan %T%1%n
pl: %) Usuniêto plan %T%1%n

source: %) Removed user's plans
pl: %) Usuniêto plany u¿ytkownika

source: %! Plan %T%1%n already exists
pl: %! Plan %T%1%n ju¿ istnieje

source: %! Plan %T%1%n do not exists
pl: %! Plan %T%1%n nie istnieje

source: %! No plans
pl: %! Brak planów

source: %! If time travels were possible...
pl: %! Gdyby mo¿na by³o cofn±æ czas...

source: %> Created timer %T%1%n
pl: %> Utworzono timer %T%1%n

source: %) Removed timer %T%1%n
pl: %) Usuniêto timer %T%1%n

source: %) Removed user's timers
pl: %) Usuniêto timery u¿ytkownika

source: %! Timer %T%1%n already exists
pl: %! Timer %T%1%n ju¿ istnieje

source: %! Timer %T%1%n does not exists
pl: %! Timer %T%1%n nie istnieje

source: %! No timers
pl: %! Brak timerów

source: %! No messages logged
pl: %! Nie zalogowano ¿adnych wiadomo¶ci

source: %! No messages from %T%1%n logged
pl: %! Nie zalogowano ¿adnych wiadomo¶ci dla %T%1%n

source: %) Messages from %T%1%n cleared
pl: %) Wiadomo¶ci dla %T%1%n wyczyszczone

source: %) All messages cleared
pl: %) Wszystkie wiadomo¶ci wyczyszczone

source: %) Message queue cleared
pl: %) Kolejka wiadomo¶ci wyczyszczona

source: %) Message queue for %T%1%n cleared
pl: %) Kolejka wiadomo¶ci wyczyszczona dla %T%1%n

source: %! Command works only when disconected
pl: %! Komenda dzia³a tylko przy braku po³±czenia z serwerem

source: %! Messaged queue is empty
pl: %! Kolejka wiadomo¶ci jest pusta

source: %! No messages to %T%1%n in queue
pl: %! Brak wiadomo¶ci w kolejce dla %T%1%n

source: %> (%1) Sent messages from queue
pl: %> (%1) Wys³ano zaleg³e wiadomo¶ci z kolejki

source: %! No conference
pl: %! Brak konferencji

source: %> %T%1%n: %2 (%yignored%n)
pl: %> %T%1%n: %2 (%yignorowana%n)

source: %> Created conference %T%1%n
pl: %> Utworzono konferencjê %T%1%n

source: %! Conference not created %T%1%n
pl: %! Nie utworzono konferencji %T%1%n

source: %) Removed conference %T%1%n
pl: %) Usuniêto konferencjê %T%1%n

source: %) Removed all conferences
pl: %) Usuniêto wszystkie konferencje

source: %! Conference %T%1%n already exists
pl: %! Konferencja %T%1%n ju¿ istnieje

source: %! Conference %T%1%n do not exists
pl: %! Konferencja %T%1%n nie istnieje

source: %! Conference name should start with %T#%n
pl: %! Nazwa konferencji powinna zaczynaæ siê od %T#%n

source: %> Conference renamed: %T%1%n --> %T%2%n
pl: %> Nazwa konferencji zmieniona: %T%1%n --> %T%2%n

source: %> Konference %T%1%n will be ignored
pl: %> Konferencja %T%1%n bêdzie ignorowana

source: %> Conference %T%1%n won't be ignored
pl: %> Konferencja %T%1%n nie bêdzie ignorowana

source: %> Joined %1 to conference %T%2%n
pl: %> Do³±czono %1 do konferencji %T%2%n

source: %> %1 already in conference %T%2%n
pl: %> %1 uczestniczy ju¿ w konferencji %T%2%n

source: Can not connect ro server
pl: Nie mo¿na po³±czyæ siê z serwerem

source: %> Removed %T%1->%2%n
pl: %> Usuniêto %T%1->%2%n

source: %! Unknown variable: %T%1->%2%n
pl: %! Nieznana zmienna: %T%1->%2%n

source: %! Session list is empty
pl: %! Lista sesji jest pusta

source: %! Session %T%1%n already exists
pl: %! Sesja %T%1%n ju¿ istnieje

source: %! Sesion %T%1%n does not exist
pl: %! Sesja %T%1%n nie istnieje

source: %> Created session %T%1%n
pl: %> Utworzono sesjê %T%1%n

source: %> Removed session %T%1%n
pl: %> Usuniêto sesjê %T%1%n

source: %! Can't change session in query window%n
pl: %! Nie mo¿na zmieniæ sesji w okienku rozmowy%n

source: %merror%n
pl: %mb³±d%n

source: %! Plugin %T%1%n already loaded%n.
pl: %! Plugin %T%1%n jest ju¿ za³adowany%n.

source: %! Plugin %T%1%n can not be found%n
pl: %! Plugin %T%1%n nie mo¿e zostaæ znaleziony%n

source: %! Plugin %T%1%n is not correct EKG2 plugin%n
pl: %! Plugin %T%1%n nie jest prawid³owym pluginem EKG2%n

source: %! Plugin %T%1%n not initialized correctly%n
pl: %! Plugin %T%1%n nie zosta³ wczytany poprawnie%n

source: %! Plugin %T%1%n is an UI plugin and can't be unloaded%n
pl: %! Plugin %T%1%n jest pluginem UI i nie mo¿e zostaæ wy³adowany%n

source: %> Plugin %T%1%n loaded%n
pl: %> Plugin %T%1%n zosta³ za³adowany%n

source: %> Plugin %T%1%n unloaded%n
pl: %> Plugin %T%1%n zosta³ wy³adowany%n

source: %> Plugin %T%1%n prio is setted to %T%2%n
pl: %> Priorytet plugin %T%1%n zosta³ ustawiony na%T%2%n

source: %> Plugins prio setted to default
pl: %> Priorytet pluginu zosta³ ustawiony na domy¶lny

source: %! Error running code
pl: %! B³±d wykonywania kodu

source: %! No scripts loaded
pl: %! Brak za³adowanych skryptów

source: %! No filename given
pl: %! Nie podano nazwy pliku

source: %! Error %T%1%n
pl: %! B³±d %T%1%n

source: %! Can't find script %T%1%n
pl: %! Nie znaleziono skryptu %T%1%n

source: %! Script have to be in %T%1%n (don't add path)
pl: %! Skrypt musi siê znajdowaæ w katalogu %T%1%n (nie podawaj ¶cie¿ki)

source: %> Token was written to the file %T%1%n
pl: %> Token zapisano do pliku %T%1%n

source: %! Error getting token: %1
pl: %! B³±d podczas pobierania tokena

source: %! Token getting timeout
pl: %! Przekroczono limit czasu pobierania tokenu

source: %! Your operating system doesn't support tokens
pl: %! System operacyjny nie zawiera funkcji potrzebnych do obs³ugi tokenów

source: %! First get token by function %Ttoken%n
pl: %! Nale¿y najpierw pobraæ z serwera token komend± %Ttoken%n

source: %> (%1) User %T%2%n is connected
pl: %> (%1) U¿ytkownik %T%2%n jest po³±czony

source: %> (%1) User %T%2%n is not connected
pl: %> (%1) U¿ytkownik %T%2%n nie jest po³±czony

source: %! Can't open file for image %1
pl: %! Nie mo¿na utworzyæ pliku %T%1%n

source: %! Error sending image
pl: %! B³±d podczas wysy³ania obrazka

source: %> Image sent properly
pl: %> Obrazek zosta³ wys³any prawid³owo

source: %> Image saved in %1
pl: %> Obrazek zosta³ zapisany jako %1

source: %> (%1) We are being checked by %T%2%n
pl: %> (%1) Jeste¶my sprawdzani przez %T%2%n

source: %> %Y%2%n has joined %4
pl: %> %Y%2%n do³±czy³ do %4

source: %> %RYou%n have joined %4
pl: %> %YDo³±czy³e¶%n do %4

source: %> %g%2%n has left %4 (%5)
pl: %> %g%2%n opu¶ci³ %4 (%5)

source: %> %RYou%n have left %4 (%5)
pl: %> %gOpu¶ci³e¶%n %4 (%5)

source: %> %Y%2%n has been kicked out by %R%3%n from %5 (%6)
pl: %> %Y%2%n zosta³ wykopany przez %R%3%n z %5 (%6)

source: %> You have been kicked out by %R%3%n from %5 (%6)
pl: %> Zosta³e¶ wykopany z %R%3%n przez %5 (%6)

source: %> %Y%2%n has quit irc (%4)
pl: %> %Y%2%n opu¶ci³ irc (%4)

source: %> %Y%2%n sent unknown CTCP %3: (%4)
pl: %> %Y%2%n wys³a³ nieznany CTCP %3: (%4)

source: %> %Y%2%n requested ctcp %5 from %4
pl: %> %Y%2%n zarz±da³ CTCP %5 od %4

source: %> %Y%2%n requested ctcp %5
pl: %> %Y%2%n zarz±da³ CTCP %5

source: %> %Y%2%n CTCP reply from %3: %5
pl: %> %Y%2%n odpowied¼ CTCP od %3: %5

source: %> Cannot send to channel %T%2%n
pl: %> Nie mo¿na pisaæ na kana³ %T%2%n

source: %G||%n away : %2 - %3
pl: %G||%n zajêty : %2 - %3

source: %G.+===%g----- %G||%n (%T%2%n) (%3@%4) %G||%n realname : %6
pl: %G.+===%g----- %G||%n (%T%2%n) (%3@%4) %G||%n prawdziwa nazwa : %6

source: %G||%n %|channels : %3
pl: %G||%n %|kana³y : %3

source: %G||%n %|server : %3 (%4)
pl: %G||%n %|serwer : %3 (%4)

source: %G||%n %|idle : %3 (signon: %4)
pl: %G||%n %|brak aktywno¶ci : %3 (zalogowany: %4)

source: %> Topic %2: %3
pl: %> Temat %2: %3

source: %> set by %2 on %4
pl: %> ustawiony przez %2 dnia %4

source: %> %T%2%n changed topic on %T%4%n: %5
pl: %> %T%2%n zmieni³ temat na %T%4%n: %5

source: %> %T%2%n unset topic on %T%4%n
pl: %> %T%2%n wyczy¶ci³ temat na %T%4%n

source: %> %2/%4 sets mode [%5]
pl: %> %2/%4 ustawia tryb [%5]

source: %> %2 mode is [%3]
pl: %> %2 tryb jest [%3]

source: %> (%1) %2 set mode %3 on You
pl: %> (%1) %2 ustawia tryb %3 na Tobie

source: %> %W%2%n invites you to %W%5%n
pl: %> %W%2%n zaprasza Ciê na %W%5%n

source: %> You are now known as %G%3%n
pl: %> Jeste¶ teraz znany jako %G%3%n

source: %> %g%2%n is now known as %G%4%n
pl: %> %g%2%n jest znany jako %G%4%n

source: %> (%2) %T%1%n asks for authorisation. Use "/auth -a %1" to accept, "/auth -d %1" to refuse.%n
pl: %> (%2) %T%1%n prosi o autoryzacjê dodania. U¿yj "/auth -a %1" aby zaakceptowaæ, "/auth -d %1" aby odrzuciæ.%n

source: %> (%2) %T%1%n asks for removal. Use "/auth -d %1" to delete.%n
pl: %> (%2) %T%1%n prosi o autoryzacjê usuniêcia. U¿yj "/auth -d %1" aby usun±æ.%n

source: %! (%1) Error parsing XML%n
pl: %! (%1) B³±d parsowania XMLa%n

source: %> (%2) Sent authorisation request to %T%1%n.
pl: %> (%2) Wys³ano ¿±danie autoryzacji do %t%1%n.

source: %> (%2) Authorised %T%1%n.
pl: %> (%2) Autoryzowano %T%1%n.

source: %> (%2) Asked %T%1%n to remove authorisation.
pl: %> (%2) Wys³ano pro¶bê o cofniêcie autoryzacji do %T%1%n.

source: %> (%2) Authorisation for %T%1%n revoked.
pl: %> (%2) Cofniêto autoryzacjê %T%1%n.

source: %> (%2) Authorisation for %T%1%n denied.
pl: %> (%2) Odmówiona autoryzacji %T%1%n.

source: %> (%2) Sent presence probe to %T%1%n.
pl: %> (%2) Wys³ano pytanie o obecno¶æ do %T%1%n.

source: %! (%1) Error connecting to Jabber server%n
pl: %! (%1) B³±d ³±czenia siê z serwerem Jabbera%n

source: %! Message to %T%1%n can't be delivered: %R(%2) %r%3%n
pl: %! Wiadomo¶æ do %T%1%n nie mog³a byæ dostarczona: %R(%2) %r%3%n

source: %! Message to %T%1%n %y(%n%K%4(...)%y)%n can't be delivered: %R(%2) %r%3%n
pl: %! Wiadomo¶æ do %T%1%n %y(%n%K%4(...)%y)%n nie mog³a byæ dostarczona: %R(%2) %r%3%n

source: %> Jabber ID: %T%1%n %> Client name: %T%2%n %> Client version: %T%3%n %> Operating system: %T%4%n
pl: %> Identyfikator Jabbera: %T%1%n %> Nazwa programu: %T%2%n %> Wersja programu: %T%3%n %> System operacyjny: %T%4%n

source: %> Jabber ID: %T%1%n %> Full Name: %T%2%n %> Nickname: %T%3%n %> Birthday: %T%4%n %> City: %T%5%n %> Desc: %T%6%n
pl: %> Identyfikator Jabbera: %T%1%n %> Pe³na nazwa: %T%2%n %> Pseudonim: %T%3%n %> Urodziny: %T%4%n %> Miasto: %T%5%n %> Opis: %T%6%n

source: %! (%1) User's resource unknown%n
pl: %! (%1) Nieznany resource u¿ytkownika%n

source: %! (%1) Unable to check version, because %2 is unavailable%n
pl: %! (%1) Nie mo¿na sprawdziæ wersji, poniewa¿ u¿ytkownik %2 nie jest dostêpny%n

source: %> %T%1%n is typing to us ...%n
pl: %> U¿ytkownik %T%1%n co¶ do nas pisze ...%n

source: %! Error initialising charset conversion (%1->%2): %3
pl: %! B³ad przy inicjalizacji kodowania(%1->%2): %3

source: Error connecting to Jabber server
pl: B³±d ³±czenia siê z serwerem Jabbera

source: unknown
pl: nieznany

source: %) You got one email
pl: %) Masz now± wiadomo¶æ email

source: %) You got %1 new emails
pl: %) Masz %1 nowe wiadomo¶ci email

source: -- Press Enter to continue or Ctrl-D to break --
pl: -- Wci¶nij Enter by kontynuowaæ lub Ctrl-D by przerwaæ --

source: %> Please wait, generating keys...
pl: %> Czekaj, generujê klucze...

source: %> Keys generated and saved
pl: %> Wygenerowano i zapisano klucze

source: %! Error while generating keys: %1
pl: %! Wyst±pi³ b³±d podczas generowania kluczy: %1

source: %! You already own a key pair
pl: %! Posiadasz ju¿ swoj± parê kluczy

source: %) Public key %1 removew
pl: %) Klucz publiczny %1 zosta³ usuniêty

source: %! Can find %1's public key
pl: %! Nie znaleziono klucza publicznego %1

source: %! No public keys
pl: %! Brak kluczy publicznych

source: %> Received public key from %1
pl: %> Otrzymano klucz publiczny od %1

source: %! Error while saving public key: %1
pl: %! B³±d podczas zapisu klucza publicznego: %1

source: %> Sent public key to %1
pl: %> Wys³ano klucz publiczny do %1

source: %! Error sending public key
pl: %! B³±d podczas wysy³ania klucza publicznego

source: %! Error sending SMS: %1
pl: %! B³±d wysy³ania SMS: %1

source: %! %1 not a cellphone number
pl: %! %1 nie ma podanego numeru komórki

source: %> SMS to %T%1%n sent
pl: %> SMS do %T%1%n zosta³ wys³any

source: %! SMS to %T%1%n not sent
pl: %! SMS do %T%1%n nie zosta³ wys³any

source: new message from %1 at %2
pl: nowa wiadomo¶æ od %1 na %2

source: new message from %1
pl: nowa wiadomo¶æ od %1

source: %1 is online,
pl: %1 jest dostêpn%@1,

source: %1 is away,
pl: %1 jest zajêt%@1,

source: %1: do not disturb,
pl: %1: nie przeszkadzaæ,

source: %1 is extended away,
pl: %1 jest bardzo zajêt%@1,

source: %1 is offline,
pl: %1 jest niedostêpn%@1,

source: %1 is invisible,
pl: %1 jest niewidoczn%@1,

source: %1 is free for chat,
pl: %1 jest chêtn%@1 do rozmowy,

source: %1: status error,
pl: %1: b³±d pobierania statusu,

source: %1 is blocking us,
pl: %1 blokuje nas,

source: [no description]
pl: [brak opisu]

source: ekg2 XOnScreenDisplay plugin
pl: Wtyczka XOnScreenDisplay dla ekg2

source: Author: Adam 'dredzik' Kuczynski
pl: Autor: Adam 'dredzik' Kuczyñski
